### live

<details><summary>Show Plan - no change</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra-data relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/dphoto/dphoto/deployments/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/dphoto/dphoto/deployments

To view this run in a browser, visit:
https://app.terraform.io/app/dphoto/dphoto-live/runs/run-xMAn2ZyjQweaC9Gr

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
aws_iam_user.cli: Refreshing state... [id=dphoto-live-cli]
aws_sqs_queue.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo]
data.aws_iam_policy_document.index_rw: Reading...
aws_ssm_parameter.catalog_table_name: Refreshing state... [id=/dphoto/live/dynamodb/catalog/tableName]
aws_s3_bucket.cache: Refreshing state... [id=dphoto-live-cache]
aws_kms_key.storage[0]: Refreshing state... [id=64ce2c68-36b4-49cf-8f4e-4e78ec71a41c]
aws_s3_bucket.storage: Refreshing state... [id=dphoto-live-storage]
aws_sns_topic.archive: Refreshing state... [id=arn:aws:sns:eu-west-1:472045025110:dphoto-live-archive-jobs]
data.aws_iam_policy_document.index_rw: Read complete after 0s [id=1595237765]
aws_iam_policy.index_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-index-rw]
aws_iam_access_key.rolling_cli["2022-12"]: Refreshing state... [id=AKIAW32ATO5LEM4353GJ]
aws_iam_user_policy_attachment.cli_table: Refreshing state... [id=dphoto-live-cli-20210527210154843500000002]
aws_ssm_parameter.iam_policy_dyn_table_rw: Refreshing state... [id=/dphoto/live/iam/policies/indexRWArn]
aws_ssm_parameter.sqs_archive_url: Refreshing state... [id=/dphoto/live/sqs/archive/url]
data.aws_iam_policy_document.archive_sqs_send: Reading...
aws_ssm_parameter.sqs_archive_arn: Refreshing state... [id=/dphoto/live/sqs/archive/arn]
data.aws_iam_policy_document.archive_sqs_send: Read complete after 0s [id=753618035]
aws_iam_policy.archive_sqs_send: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-live-archive-sqs-send]
data.aws_iam_policy_document.archive_sns_publish: Reading...
data.aws_iam_policy_document.archive_sqs: Reading...
data.aws_iam_policy_document.archive_sns_publish: Read complete after 0s [id=393849065]
data.aws_iam_policy_document.archive_sqs: Read complete after 0s [id=773311283]
aws_ssm_parameter.sns_archive_arn: Refreshing state... [id=/dphoto/live/sns/archive/arn]
aws_iam_policy.archive_sns_publish: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-live-archive-sns-publish]
aws_sqs_queue_policy.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo]
aws_ssm_parameter.iam_policy_archive_sqs_send: Refreshing state... [id=/dphoto/live/iam/policies/archive_sqs_send/arn]
aws_iam_user_policy_attachment.archive_sqs_send: Refreshing state... [id=dphoto-live-cli-20220728232010840800000003]
aws_ssm_parameter.iam_policy_archive_sns_publish: Refreshing state... [id=/dphoto/live/iam/policies/archive_sns_publish/arn]
aws_iam_user_policy_attachment.archive_sns_publish: Refreshing state... [id=dphoto-live-cli-20220728231945971600000001]
data.aws_iam_policy_document.cache_rw: Reading...
aws_s3_bucket_public_access_block.s3_cache_block_public_access: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_ownership_controls.cache: Refreshing state... [id=dphoto-live-cache]
data.aws_iam_policy_document.cache_rw: Read complete after 0s [id=129955124]
aws_s3_bucket_lifecycle_configuration.cache_expiration: Refreshing state... [id=dphoto-live-cache]
aws_ssm_parameter.cache_bucket_name: Refreshing state... [id=/dphoto/live/s3/cache/bucketName]
aws_s3_bucket_acl.cache: Refreshing state... [id=dphoto-live-cache,private]
aws_s3_bucket_versioning.cache: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_server_side_encryption_configuration.cache["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"]: Refreshing state... [id=dphoto-live-cache]
aws_iam_policy.cache_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-cache-rw]
aws_s3_bucket_acl.storage: Refreshing state... [id=dphoto-live-storage,private]
aws_s3_bucket_server_side_encryption_configuration.storage["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"]: Refreshing state... [id=dphoto-live-storage]
aws_ssm_parameter.storage_bucket_name: Refreshing state... [id=/dphoto/live/s3/storage/bucketName]
aws_s3_bucket_public_access_block.s3_storage_block_public_access: Refreshing state... [id=dphoto-live-storage]
data.aws_iam_policy_document.storage_rw: Reading...
data.aws_iam_policy_document.storage_rw: Read complete after 0s [id=2008889015]
aws_s3_bucket_versioning.storage: Refreshing state... [id=dphoto-live-storage]
data.aws_iam_policy_document.storage_ro: Reading...
data.aws_iam_policy_document.storage_ro: Read complete after 0s [id=2651647098]
aws_s3_bucket_lifecycle_configuration.storage: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_ownership_controls.storage: Refreshing state... [id=dphoto-live-storage]
aws_iam_user_policy_attachment.cli_cache: Refreshing state... [id=dphoto-live-cli-20220728231947722900000002]
aws_ssm_parameter.iam_policy_cache_rw: Refreshing state... [id=/dphoto/live/iam/policies/cacheRWArn]
aws_iam_policy.storage_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-rw]
aws_iam_policy.storage_ro: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-ro]
aws_iam_user_policy_attachment.cli_bucket: Refreshing state... [id=dphoto-live-cli-20210527210154836100000001]
aws_ssm_parameter.iam_policy_bucket_ro: Refreshing state... [id=/dphoto/live/iam/policies/storageROArn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.rolling_cli["2024-04"] will be created
  + resource "aws_iam_access_key" "rolling_cli" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + pgp_key                        = "keybase:thomasduchatelle"
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "dphoto-live-cli"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ delegate_access_key_id                 = {
      + "2024-04" = (known after apply)
        # (1 unchanged element hidden)
    }
  ~ delegate_secret_access_key             = {
      + "2024-04" = (known after apply)
        # (1 unchanged element hidden)
    }
  ~ delegate_secret_access_key_decrypt_cmd = "terraform output -raw delegate_secret_access_key | base64 --decode | keybase pgp decrypt" -> "terraform output -json | jq -r '.delegate_secret_access_key.value[\"2024-04\"]' | base64 --decode | keybase pgp decrypt"

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 11 estimated
           $1.00000000000000272/mo +$0.0

```

</details>

*Action: `push`*